"""
Задание 1.
    
    Напишите программу, которая принимает на вход цифру, обозначающую день недели, и выводит название этого дня недели.
    1 –> Понедельник
    10 –> Нет такого дня
    7 –> Воскресение
"""
day = int(input('Введите день: '))
if day == 1:
    print('Понедельник')
elif day == 2:
    print('Вторник')
elif day == 3:
    print('Среда')
elif day == 4:
    print('Четверг')
elif day == 5:
    print('Пятница')
elif day == 6:
    print('Суббота')
elif day == 7:
    print('Воскресенье')
else:
    print('Нет такого дня')